#Создай класс Task, который позволяет управлять задачами (делами).
# У задачи должны быть атрибуты: описание задачи, срок выполнения и статус (выполнено/не выполнено).
# Реализуй функцию для добавления задач, отметки выполненных задач и вывода списка текущих (не выполненных) задач.

#________________________________Создание Конструкторa класса Task_____________________________________________________
class Task: #класс Task, который позволяет управлять задачами (делами).
    def __init__(self):  #  экземпляр класса Task.
        self.tasks = [] # список задач.

    def add_task(self, description, deadline): # функция добавления задачи.
        self.tasks.append({'deadline': deadline, 'description': description,
                            'status': 'не выполнено'}) # добавляем задачу в список задач.
        print(f'Задача "{description}" добавлена.') # выводим сообщение о добавлении задачи.

    def mark_task_as_completed(self, description): # Будем передавать в эту функцию название задачи.
        for task in self.tasks: # перебираем список задач.
            if task['description'] == description: # если задача совпадает с той, которая внутри списка.
                task['status'] = 'выполнено' # если задачи совпадают, меняем статус задачи на выполнено
                print(f'Задача "{description}" выполнена.') # выводим сообщение о выполнении задачи.
            else: # если задача не совпадает с той, которая внутри списка.
                print(f"Задача {description} не найдена в списке.")# выводим сообщение о не выполнении задачи.

    def print_tasks(self): # функция вывода списка текущих задач.
        print('Текущие задачи:')  # выводим сообщение о текущих задачах.
        for task in self.tasks: # перебираем список задач.
            if task['status'] == 'не выполнено': # если задача не выполнена.
                print(f'{task["deadline"]} -{task["description"]}') # выводим задачу.

#________________________________Создание объекта  класса Task_________________________________________________________
task_men = Task() # создаем объект класса Task.
task_men.add_task("Попить воды", "18.10.2024") # добавляем задачу.
task_men.add_task("Погулять", "18.10.2024") # добавляем задачу.
task_men.add_task("Почитать книгу", "18.10.2024") # добавляем задачу.
print("  ") # выводим пробел.
task_men.print_tasks() # выводим список задач.
print("  ") # выводим пробел.
task_men.mark_task_as_completed("Почитать книгу") # выполняем задачу.








